inst/templates/GetAllHierarchies.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:sur="http://tools.rki.de/SurvStat/" xmlns:rki="http://schemas.datacontract.org/2004/07/Rki.SurvStat.WebService.Contracts.Mdx">
   {{>header}}
   <soap:Body>
      <sur:GetAllHierarchies>
         <sur:request>
            <rki:Cube>{{cube}}</rki:Cube>
            <rki:Language>{{language}}</rki:Language>
         </sur:request>
      </sur:GetAllHierarchies>
   </soap:Body>
</soap:Envelope>